artillery-api-eb/api-to-eb-to-api.yml
config:
  target: "https://webhook.site/07cd8aa4-9120-4871-b16a-2ee12df4c0ea"
  phases:
    - duration: 2
      arrivalRate: 1
  payload:
    path: "message.csv"
    fields:
      - "id"
      - "contacts"
    loadAll: true
    cast: true
    order: random
  http:
    # HTTP requests from all virtual users will be sent over the same ten connections.
    pool: 10
    timeout: 350

scenarios:
  - name: "Send dropoff"
    flow:
      - post:
          url: "/upload"
          json:
            id: "{{ id }}"
            contacts: "{{ contacts }}"
          capture: 
            json: "$.Entries"
            as: "message_id"
      - log: "Reuest id: {{ message_id }}"